BAS BMEKZU Project/src/Documents/ИНАГРО_СвидетельствоОКачествеЗерна/ИНАГРО_СвидетельствоОКачествеЗерна.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_СвидетельствоОКачествеЗерна</name>
  <basedOn>Document.ИНАГРО_ЛабораторныйАнализ</basedOn>
  <attributes>
    <name>ВидХранения</name>
    <type>
      <types>CatalogRef.ИНАГРО_ВидыХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзготовления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗерноваяПримесь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контракт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Куда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛабораторныйАнализ</name>
    <type>
      <types>DocumentRef.ИНАГРО_ЛабораторныйАнализ</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАнализа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДвиженияФормы36</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Откуда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СорнаяПримесь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Урожай</name>
    <type>
      <types>CatalogRef.ИНАГРО_ВидыУрожая</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

BAS BMEKZU Project/src/Enums/ИНАГРО_ТипыХарактеристик/ИНАГРО_ТипыХарактеристик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИНАГРО_ТипыХарактеристик</name>
  <comment>Я</comment>
  <enumValues>
    <name>ВидЗерновойПримеси</name>
    <comment>31</comment>
  </enumValues>
  <enumValues>
    <name>ВидСорнойПримеси</name>
    <comment>21</comment>
  </enumValues>
  <enumValues>
    <name>ПроходСита</name>
    <comment>99</comment>
  </enumValues>
  <enumValues>
    <name>Прочие</name>
    <comment>40</comment>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Documents/ИНАГРО_ЛабораторныйАнализ/ИНАГРО_ЛабораторныйАнализ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_ЛабораторныйАнализ</name>
  <registerRecords>AccumulationRegister.ИНАГРО_РасчетыПоУслугам</registerRecords>
  <attributes>
    <name>Вентилирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесОбразцов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЖурнала</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыЖурналов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидХранения</name>
    <type>
      <types>CatalogRef.ИНАГРО_ВидыХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецЛабАнализа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗерноваяПримесь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Масличность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассаПартии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОпределенияСтекловидности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАнализа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПробы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерУдостоверения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДвиженияФормы36</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Очистка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Происхождение</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ИНАГРО_ПроисхождениеЗерна</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Силос</name>
    <type>
      <types>CatalogRef.ИНАГРО_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СорнаяПримесь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияНазначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияОтправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сушка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЖурнала</name>
    <type>
      <types>CatalogRef.ИНАГРО_ТипыЖурналов</types>
    </type>
  </attributes>
  <attributes>
    <name>Урожай</name>
    <type>
      <types>CatalogRef.ИНАГРО_ВидыУрожая</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЖурнал</name>
    <type>
      <types>CatalogRef.УдалитьИНАГРО_ЛабораторныеЖурналы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСкладСилос</name>
    <type>
      <types>CatalogRef.ИНАГРО_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСушитьАктивнымВентилированием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Результаты</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ИНАГРО_ХарактеристикиВидовКультур</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ИНАГРО_ХарактеристикиВидовКультур</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопИнформация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Удалить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/Documents/ИНАГРО_СвидетельствоОКачествеЗерна/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииПечати

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Форма40
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_Форма40";
	КомандаПечати.Представление = НСтр("ru='Форма40';uk='Форма40'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаВыбора,ФормаДокумента";	
	
	// Форма40_а
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_Форма40_а";
	КомандаПечати.Представление = НСтр("ru='Форма40_а';uk='Форма40_а'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаВыбора,ФормаДокумента";
		
	// Форма41
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_Форма41";
	КомандаПечати.Представление = НСтр("ru='Форма41';uk='Форма41'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаВыбора,ФормаДокумента";

	// Форма42
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_Форма42";
	КомандаПечати.Представление = НСтр("ru='Форма42';uk='Форма42'");
   	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
    КомандаПечати.СписокФорм    = "ФормаСписка,ФормаВыбора,ФормаДокумента";
	
	// Форма42_2013
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_Форма42_2013";
	КомандаПечати.Представление = НСтр("ru='Форма42_2013';uk='Форма42_2013'");
   	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
    КомандаПечати.СписокФорм    = "ФормаСписка,ФормаВыбора,ФормаДокумента";
	
	// Форма42_2014
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_Форма42_2014";
	КомандаПечати.Представление = НСтр("ru='Форма42_2014';uk='Форма42_2014'");
   	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
    КомандаПечати.СписокФорм    = "ФормаСписка,ФормаВыбора,ФормаДокумента";
	
	// Форма40 2021
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_UK_Форма40_2021";
	КомандаПечати.Представление = НСтр("ru='Форма40 (2021)';uk='Форма40 (2021)'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаВыбора,ФормаДокумента";	

	// Форма40_а 2021
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_UK_Форма40_а_2021";
	КомандаПечати.Представление = НСтр("ru='Форма40_а (2021)';uk='Форма40_а (2021)'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаВыбора,ФормаДокумента";

	// Форма41 2021
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_UK_Форма41_2021";
	КомандаПечати.Представление = НСтр("ru='Форма41 (2021)';uk='Форма41 (2021)'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаВыбора,ФормаДокумента";

	// Форма42 2021
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_UK_Форма42_2021";
	КомандаПечати.Представление = НСтр("ru='Форма42 (2021)';uk='Форма42 (2021)'");
   	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
    КомандаПечати.СписокФорм    = "ФормаСписка,ФормаВыбора,ФормаДокумента";

	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр";
	КомандаПечати.Представление = НСтр("ru='Реестр документов';uk='Реєстр документів'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru='Реестр документов ""Свидетельство о качестве зерна""';uk='Реєстр документів ""Свідоцтво про якість зерна""'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм    = "ФормаСписка";
	КомандаПечати.Порядок       = 100;

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма40") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_Форма40", НСтр("ru='Форма40';uk='Форма40'"), 
            ПечатьФорма40(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_Форма40", , Ложь);
			
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма40_а") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_Форма40_а", НСтр("ru='Форма40_а';uk='Форма40_а'"), 
	        ПечатьФорма40_а(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_Форма40_а", , Ложь);
			
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма41") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_Форма41", НСтр("ru='Форма41';uk='Форма41'"), 
	        ПечатьФорма41(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_Форма41", , Ложь);
			
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма42") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_Форма42", НСтр("ru='Форма42';uk='Форма42'"), 
	        ПечатьФорма42(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_Форма42", , Ложь);
				
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма42_2013") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_Форма42_2013", НСтр("ru='Форма42_2013';uk='Форма42_2013'"), 
	        ПечатьФорма42_2013(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_Форма42_2013", , Ложь);
				
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма42_2014") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_Форма42_2014", НСтр("ru='Форма42_2014';uk='Форма42_2014'"), 
	        ПечатьФорма42_2014(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_Форма42_2014", , Ложь);
				
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_UK_Форма40_2021") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_UK_Форма40_2021", НСтр("ru='Форма40 (2021)';uk='Форма40 (2021)'"), 
        	ПечатьФорма40_2021(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_UK_Форма40_2021", , Ложь);
			
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_UK_Форма40_а_2021") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_UK_Форма40_а_2021", НСтр("ru='Форма40_а (2021)';uk='Форма40_а (2021)'"), 
	        ПечатьФорма40_а_2021(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_UK_Форма40_а_2021", , Ложь);

	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_UK_Форма41_2021") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_UK_Форма41_2021", НСтр("ru='Форма41 (2021)';uk='Форма41 (2021)'"), 
	        ПечатьФорма41_2021(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_UK_Форма41_2021", , Ложь);
			
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_UK_Форма42_2021") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_UK_Форма42_2021", НСтр("ru='Форма42 (2021)';uk='Форма42 (2021)'"), 
	        ПечатьФорма42_2021(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_UK_Форма42_2021", , Ложь);

	КонецЕсли;	
	
КонецПроцедуры

Функция ПечатьФорма40(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗапросРезультат = Новый Запрос;
	ЗапросРезультат.Текст = 
		"ВЫБРАТЬ
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Характеристика КАК Характеристика,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Значение КАК Значение,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Ссылка.Сорт КАК Сорт,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Ссылка.ЧислоМест КАК ЧислоМест
		|ИЗ
		|	Документ.ИНАГРО_ЛабораторныйАнализ.Результаты КАК ИНАГРО_ЛабораторныйАнализРезультаты
		|ГДЕ
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Ссылка = &ЛабАнализТекущегоДокумента
		|
		|СГРУППИРОВАТЬ ПО
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Характеристика,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Значение,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Ссылка.Сорт,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Ссылка.ЧислоМест";
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНАГРО_СвидетельствоОКачествеЗерна_Форма40";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_Форма40");
    
    // печать производится на языке, указанном в настройках пользователя
    КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
    Макет.КодЯзыкаМакета = КодЯзыкаПечать;
    
    ПервыйДокумент = Истина;	
	
	Для каждого Ссылка Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		ЗапросРезультат.УстановитьПараметр("ЛабАнализТекущегоДокумента",Ссылка.ЛабораторныйАнализ); 
		ТЧРезультаты = ЗапросРезультат.Выполнить().Выгрузить();

		Шапка = Макет.ПолучитьОбласть("Шапка");
		СведенияООтправителе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Ссылка.Организация, Ссылка.Дата);
		Шапка = Макет.ПолучитьОбласть("Шапка");
		Шапка.Параметры.Номер = ИНАГРО_Общий.ВернутьКодБезПрефикса(Ссылка.Номер);
		Шапка.Параметры.День = Формат(Ссылка.Дата, "ДФ=дд");
		Шапка.Параметры.Месяц = Формат(Ссылка.Дата, "ДФ=ММММ");
		Шапка.Параметры.Год = Формат(Ссылка.Дата, "ДФ=гг");
		Шапка.Параметры.ЄДРПОУ = СведенияООтправителе.КодПоЕДРПОУ; 
		Шапка.Параметры.Организация = Ссылка.Организация.НаименованиеПолное;
		Шапка.Параметры.Транспорт = Ссылка.НомерТранспорта;
		Шапка.Параметры.Номенклатура = Ссылка.Номенклатура;  
		Шапка.Параметры.НомерНакладной = Ссылка.НомерНакладной; 
		Шапка.Параметры.Вес = Ссылка.ФизическийВес;
		Шапка.Параметры.СтанцияОтправителя = Ссылка.Откуда; 
		Шапка.Параметры.СтанцияПолучателя = Ссылка.Куда;
		Шапка.Параметры.Получатель = Ссылка.Получатель;
		Шапка.Параметры.Сорт = Ссылка.ЛабораторныйАнализ.Сорт;
		Шапка.Параметры.ЧислоМест = Ссылка.ЛабораторныйАнализ.ЧислоМест;
		
        Руководители = ИНАГРО_Элеватор.ОтветственныеЛицаОрганизации(Ссылка.Организация, Ссылка.Дата);
        Шапка.Параметры.НачальникВТЛ = Руководители.НачальникВТЛ;                      

		Для каждого СтрокаТЧ из ТЧРезультаты Цикл
			Значение = СтрокаТЧ.Значение;
			Если ТипЗнч(Значение) = Тип("Строка") Тогда
				Значение = СокрЛП(СтрокаТЧ.Значение)
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Цвет
				Тогда   
				Шапка.Параметры.Цвет = Значение; 	
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Запах
				Тогда   
				Шапка.Параметры.Запах = Значение;
			КонецЕсли;	
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Вкус
				Тогда   
				Шапка.Параметры.Вкус = Значение;
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Влажность
				Тогда   
				Шапка.Параметры.Влажность = Значение;
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Зольность
				Тогда   
				Шапка.Параметры.Зольность = Значение;
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.ПроходСита
				Тогда   	
				Шапка.Параметры.ПрСита = Значение;
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.МинеральнаяПримесь
				Тогда   	
				Шапка.Параметры.МинПримесь = Значение;
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.КлейковинаКачество
				Тогда   	
				Шапка.Параметры.Качество = Значение;
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Зараженность
				Тогда   	
				Шапка.Параметры.Заражонность = Значение;
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.КлейковинаКоличество
				Тогда   	
				Шапка.Параметры.МассоваяДоля = Значение;
			КонецЕсли;			
		КонецЦикла;
		
		ТабДокумент.Вывести(Шапка);
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции 

Функция ПечатьФорма40_2021(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗапросРезультат = Новый Запрос;
	
	ЗапросРезультат.Текст = 
		"ВЫБРАТЬ
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Характеристика КАК Характеристика,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Значение КАК Значение,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Ссылка.Сорт КАК Сорт,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Ссылка.ЧислоМест КАК ЧислоМест
		|ИЗ
		|	Документ.ИНАГРО_ЛабораторныйАнализ.Результаты КАК ИНАГРО_ЛабораторныйАнализРезультаты
		|ГДЕ
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Ссылка = &ЛабАнализТекущегоДокумента
		|
		|СГРУППИРОВАТЬ ПО
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Характеристика,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Значение,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Ссылка.Сорт,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Ссылка.ЧислоМест";
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНАГРО_СвидетельствоОКачествеЗерна_Форма40_2021";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_UK_Форма40_2021");
    
    // печать производится на языке, указанном в настройках пользователя
    КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
    Макет.КодЯзыкаМакета = КодЯзыкаПечать;
    
    ПервыйДокумент = Истина;	
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		ЗапросРезультат.УстановитьПараметр("ЛабАнализТекущегоДокумента", Ссылка.ЛабораторныйАнализ); 
		ТЧРезультаты = ЗапросРезультат.Выполнить().Выгрузить();

		СведенияООтправителе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Ссылка.Организация, Ссылка.Дата);
        Руководители         = ИНАГРО_Элеватор.ОтветственныеЛицаОрганизацииИмяФамилия(Ссылка.Организация, Ссылка.Дата);

		Шапка = Макет.ПолучитьОбласть("Шапка");
		Шапка.Параметры.Номер              = ИНАГРО_Общий.ВернутьКодБезПрефикса(Ссылка.Номер);
		Шапка.Параметры.День               = Формат(Ссылка.Дата, "ДФ=дд");
		Шапка.Параметры.Месяц              = Формат(Ссылка.Дата, "ДФ=ММММ");
		Шапка.Параметры.Год                = Формат(Ссылка.Дата, "ДФ=гг");
		Шапка.Параметры.ЄДРПОУ             = СведенияООтправителе.КодПоЕДРПОУ; 
		Шапка.Параметры.Организация        = Ссылка.Организация.НаименованиеПолное;
		Шапка.Параметры.Транспорт          = Ссылка.НомерТранспорта;
		Шапка.Параметры.Номенклатура       = Ссылка.Номенклатура;  
		Шапка.Параметры.НомерНакладной     = Ссылка.НомерНакладной; 
		Шапка.Параметры.Вес                = Ссылка.ФизическийВес;
		Шапка.Параметры.СтанцияОтправителя = Ссылка.Откуда; 
		Шапка.Параметры.СтанцияПолучателя  = Ссылка.Куда;
		Шапка.Параметры.Получатель         = Ссылка.Получатель;
		Шапка.Параметры.Сорт               = Ссылка.ЛабораторныйАнализ.Сорт;
		Шапка.Параметры.ЧислоМест          = Ссылка.ЛабораторныйАнализ.ЧислоМест;		
        Шапка.Параметры.НачальникВТЛ       = Руководители.НачальникВТЛ;                      

		Для Каждого СтрокаТЧ из ТЧРезультаты Цикл
			
			Значение = СтрокаТЧ.Значение;
			
			Если ТипЗнч(Значение) = Тип("Строка") Тогда
				Значение = СокрЛП(СтрокаТЧ.Значение)
			КонецЕсли;
			
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Цвет
				Тогда   
				Шапка.Параметры.Цвет = Значение; 	
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Запах Тогда   
				Шапка.Параметры.Запах = Значение;
			КонецЕсли;	
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Вкус Тогда   
				Шапка.Параметры.Вкус = Значение;
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Влажность Тогда   
				Шапка.Параметры.Влажность = Значение;
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Зольность Тогда   
				Шапка.Параметры.Зольность = Значение;
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.ПроходСита Тогда   	
				Шапка.Параметры.ПрСита = Значение;
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.МинеральнаяПримесь Тогда   	
				Шапка.Параметры.МинПримесь = Значение;
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.КлейковинаКачество Тогда   	
				Шапка.Параметры.Качество = Значение;
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Зараженность Тогда   	
				Шапка.Параметры.Зараженность = Значение;
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.КлейковинаКоличество Тогда   	
				Шапка.Параметры.МассоваяДоля = Значение;
			КонецЕсли;			
			
		КонецЦикла;
		
		ТабДокумент.Вывести(Шапка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции 

Функция ПечатьФорма40_а(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	
	УстановитьПривилегированныйРежим(Истина);

	ТабДокумент = Новый ТабличныйДокумент;   		
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНАГРО_СвидетельствоОКачествеЗерна_Форма40_а";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_Форма40_а");
    
    // печать производится на языке, указанном в настройках пользователя
    КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
    Макет.КодЯзыкаМакета = КодЯзыкаПечать;
    
    ПервыйДокумент = Истина;	
	
	Для каждого Ссылка Из МассивОбъектов Цикл
        Руководители = ИНАГРО_Элеватор.ОтветственныеЛицаОрганизации(Ссылка.Организация, Ссылка.Дата);		
		СведенияООтправителе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Ссылка.Организация, Ссылка.Дата);
		Шапка = Макет.ПолучитьОбласть("Шапка");
		Шапка.Параметры.Номер = ИНАГРО_Общий.ВернутьКодБезПрефикса(Ссылка.Номер); 
		Шапка.Параметры.День = Формат(Ссылка.Дата, "ДФ=дд");
		Шапка.Параметры.Месяц = Формат(Ссылка.Дата, "ДФ=ММММ");
		Шапка.Параметры.Год = Формат(Ссылка.Дата, "ДФ=гг");
		Шапка.Параметры.ЄДРПОУ = СведенияООтправителе.КодПоЕДРПОУ; 
		Шапка.Параметры.Организация = Ссылка.Организация.НаименованиеПолное;
		Шапка.Параметры.Транспорт = Ссылка.НомерТранспорта;
		Шапка.Параметры.Номенклатура = Ссылка.Номенклатура;  
		Шапка.Параметры.НомерНакладной = Ссылка.НомерНакладной; 
		Шапка.Параметры.Вес = Ссылка.ФизическийВес;
		Шапка.Параметры.СтанцияОтправителя = Ссылка.Откуда; 
		Шапка.Параметры.СтанцияПолучателя = Ссылка.Куда;
		Шапка.Параметры.Получатель = Ссылка.Получатель;
		Шапка.Параметры.Примечание = Ссылка.Примечание;
		Шапка.Параметры.НачальникВТЛ = Руководители.НачальникВТЛ;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Характеристика КАК Характеристика,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Значение КАК Значение,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Ссылка.ЧислоМест КАК ЧислоМест
		|ИЗ
		|	Документ.ИНАГРО_ЛабораторныйАнализ.Результаты КАК ИНАГРО_ЛабораторныйАнализРезультаты
		|ГДЕ
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Характеристика,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Значение,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Ссылка.ЧислоМест";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка.ЛабораторныйАнализ);			  
		ТЧРезультаты = Запрос.Выполнить().Выгрузить();
		Шапка.Параметры.ЧислоМест = Ссылка.ЛабораторныйАнализ.ЧислоМест;
		
		Для каждого СтрокаТЧ из ТЧРезультаты Цикл
			
			Значение = СтрокаТЧ.Значение;
			Если ТипЗнч(Значение) = Тип("Строка") Тогда
				Значение = СокрЛП(СтрокаТЧ.Значение)
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Цвет
				Тогда   
				Шапка.Параметры.Цвет = Значение; 	
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Запах
				Тогда   
				Шапка.Параметры.Запах = Значение;
			КонецЕсли;	
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Влажность
				Тогда   
				Шапка.Параметры.Влажность = Значение;
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.МинеральнаяПримесь
				Тогда   	
				Шапка.Параметры.МинПримесь = Значение;
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Зараженность
				Тогда   	
				Шапка.Параметры.Зараженность = Значение;
			КонецЕсли;

		КонецЦикла;
		
		ТабДокумент.Вывести(Шапка);
		
	КонецЦикла;
			
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьФорма40_а_2021(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
		
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Характеристика КАК Характеристика,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Значение КАК Значение,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Ссылка.ЧислоМест КАК ЧислоМест
		|ИЗ
		|	Документ.ИНАГРО_ЛабораторныйАнализ.Результаты КАК ИНАГРО_ЛабораторныйАнализРезультаты
		|ГДЕ
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Характеристика,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Значение,
		|	ИНАГРО_ЛабораторныйАнализРезультаты.Ссылка.ЧислоМест";

	ТабДокумент = Новый ТабличныйДокумент;   		
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНАГРО_СвидетельствоОКачествеЗерна_Форма40_а_2021";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_UK_Форма40_а_2021");
    
    // печать производится на языке, указанном в настройках пользователя
    КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
    Макет.КодЯзыкаМакета = КодЯзыкаПечать;
    
    ПервыйДокумент = Истина;	
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		
		СведенияООтправителе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Ссылка.Организация, Ссылка.Дата);
		Руководители         = ИНАГРО_Элеватор.ОтветственныеЛицаОрганизацииИмяФамилия(Ссылка.Организация, Ссылка.Дата);		
		
		Шапка = Макет.ПолучитьОбласть("Шапка");
		Шапка.Параметры.Номер              = ИНАГРО_Общий.ВернутьКодБезПрефикса(Ссылка.Номер); 
		Шапка.Параметры.День               = Формат(Ссылка.Дата, "ДФ=дд");
		Шапка.Параметры.Месяц              = Формат(Ссылка.Дата, "ДФ=ММММ");
		Шапка.Параметры.Год                = Формат(Ссылка.Дата, "ДФ=гг");
		Шапка.Параметры.ЄДРПОУ             = СведенияООтправителе.КодПоЕДРПОУ; 
		Шапка.Параметры.Организация        = Ссылка.Организация.НаименованиеПолное;
		Шапка.Параметры.Транспорт          = Ссылка.НомерТранспорта;
		Шапка.Параметры.Номенклатура       = Ссылка.Номенклатура;  
		Шапка.Параметры.НомерНакладной     = Ссылка.НомерНакладной; 
		Шапка.Параметры.Вес                = Ссылка.ФизическийВес;
		Шапка.Параметры.СтанцияОтправителя = Ссылка.Откуда; 
		Шапка.Параметры.СтанцияПолучателя  = Ссылка.Куда;
		Шапка.Параметры.Получатель         = Ссылка.Получатель;
		Шапка.Параметры.Примечание         = Ссылка.Примечание;
		Шапка.Параметры.НачальникВТЛ       = Руководители.НачальникВТЛ;		
				
		Запрос.УстановитьПараметр("Ссылка", Ссылка.ЛабораторныйАнализ);			  
		ТЧРезультаты = Запрос.Выполнить().Выгрузить();
		
		Шапка.Параметры.ЧислоМест = Ссылка.ЛабораторныйАнализ.ЧислоМест;
		
		Для Каждого СтрокаТЧ Из ТЧРезультаты Цикл
			
			Значение = СтрокаТЧ.Значение;
			
			Если ТипЗнч(Значение) = Тип("Строка") Тогда
				Значение = СокрЛП(СтрокаТЧ.Значение)
			КонецЕсли;
			
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Цвет
				Тогда   
				Шапка.Параметры.Цвет = Значение; 	
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Запах
				Тогда   
				Шапка.Параметры.Запах = Значение;
			КонецЕсли;	
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Влажность
				Тогда   
				Шапка.Параметры.Влажность = Значение;
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.МинеральнаяПримесь
				Тогда   	
				Шапка.Параметры.МинПримесь = Значение;
			КонецЕсли;
			Если СтрокаТЧ.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Зараженность
				Тогда   	
				Шапка.Параметры.Зараженность = Значение;
			КонецЕсли;

		КонецЦикла;
		
		ТабДокумент.Вывести(Шапка);
		
	КонецЦикла;
			
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьФорма41(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	
	УстановитьПривилегированныйРежим(Истина);

	ТабДокумент = Новый ТабличныйДокумент;   		
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНАГРО_СвидетельствоОКачествеЗерна_Форма41";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_Форма41");
    
    // печать производится на языке, указанном в настройках пользователя
    КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
    Макет.КодЯзыкаМакета = КодЯзыкаПечать;
    
    ПервыйДокумент = Истина;	
	
	Для каждого Ссылка Из МассивОбъектов Цикл
		Руководители = ИНАГРО_Элеватор.ОтветственныеЛицаОрганизации(Ссылка.Организация,Ссылка.Дата);
		ОблОсновная = Макет.ПолучитьОбласть("Основная");
		ОблОсновная.Параметры.Заполнить(Ссылка);
		
		ОблОСновная.Параметры.Организация = ?(ЗначениеЗаполнено(Ссылка.Организация.НаименованиеПолное),Ссылка.Организация.НаименованиеПолное,Ссылка.Организация.Наименование);
		ОблОсновная.Параметры.ДатаДок = Формат(Ссылка.Дата,"ДЛФ=DD");
		ОблОсновная.Параметры.Получатель = ?(ЗначениеЗаполнено(Ссылка.Владелец.НаименованиеПолное),Ссылка.Владелец.НаименованиеПолное,Ссылка.Владелец.Наименование);
		ОблОсновная.Параметры.ДатаИзготовления = Формат(Ссылка.ДатаИзготовления,"ДЛФ=D");
		ВидКультуры = ИНАГРО_Элеватор.ПолучитьДополнительныйРеквизитНоменклатуры(Ссылка.Номенклатура,"ВидКультуры");
		ОблОсновная.Параметры.ГОСТ = ВидКультуры.ГОСТ;
		
		// Данные лаб. анализа
		ОблОсновная.Параметры.Сорт = Ссылка.ЛабораторныйАнализ.Сорт;
		Для Каждого Стр  Из Ссылка.ЛабораторныйАнализ.Результаты Цикл
			Если Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Ядро Тогда
				ОблОсновная.Параметры.ДоброкачЯдро = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Цвет Тогда
				ОблОсновная.Параметры.Цвет = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Запах Тогда
				ОблОсновная.Параметры.Запах = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Вкус Тогда
				ОблОсновная.Параметры.Вкус = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Влажность Тогда
				ОблОсновная.Параметры.Влажность = Стр.Значение;			
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.СорнаяПримесь Тогда
				ОблОсновная.Параметры.СорнаяПримесь = Стр.Значение;			
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.МинеральнаяПримесь Тогда
				ОблОсновная.Параметры.МинеральнаяПримесь = Стр.Значение;			
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.ВреднаяПримесь Тогда
				ОблОсновная.Параметры.ВреднаяПримесь = Стр.Значение;			
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.НеОбрушеныхЗерен Тогда
				ОблОсновная.Параметры.НеОбрушеныхЗерен = Стр.Значение;			
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.БитоеЗерно Тогда
				ОблОсновная.Параметры.БитеЗерно = Стр.Значение;			
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Испорченные Тогда
				ОблОсновная.Параметры.Испорченные = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Мучель Тогда
				ОблОсновная.Параметры.Мучель = Стр.Значение;			
			КонецЕсли;
		КонецЦикла; 		
		ОблОсновная.Параметры.НачальникВТЛ = Руководители.НачальникВТЛ;
		ОблОсновная.Параметры.Отправитель = Ссылка.Отправитель;
		
		ТабДокумент.Вывести(ОблОсновная);		
	КонецЦикла;
			
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьФорма41_2021(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	
	УстановитьПривилегированныйРежим(Истина);

	ТабДокумент = Новый ТабличныйДокумент;   		
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНАГРО_СвидетельствоОКачествеЗерна_Форма41_2021";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_UK_Форма41_2021");
    
    // печать производится на языке, указанном в настройках пользователя
    КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
    Макет.КодЯзыкаМакета = КодЯзыкаПечать;
    
    ПервыйДокумент = Истина;	
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		
		СведенияООтправителе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Ссылка.Организация, Ссылка.Дата);
		Руководители = ИНАГРО_Элеватор.ОтветственныеЛицаОрганизацииИмяФамилия(Ссылка.Организация, Ссылка.Дата);
		
		ОблОсновная = Макет.ПолучитьОбласть("Основная");
		ОблОсновная.Параметры.Заполнить(Ссылка);		
		ОблОСновная.Параметры.Организация  = ?(ЗначениеЗаполнено(Ссылка.Организация.НаименованиеПолное),Ссылка.Организация.НаименованиеПолное,Ссылка.Организация.Наименование);
		ОблОСновная.Параметры.День         = Формат(Ссылка.Дата, "ДФ=дд");
		ОблОСновная.Параметры.Месяц        = Формат(Ссылка.Дата, "ДФ=ММММ");
		ОблОСновная.Параметры.Год          = Формат(Ссылка.Дата, "ДФ=гг");
		ОблОСновная.Параметры.ЄДРПОУ       = СведенияООтправителе.КодПоЕДРПОУ;
		ОблОсновная.Параметры.Получатель   = ?(ЗначениеЗаполнено(Ссылка.Владелец.НаименованиеПолное), Ссылка.Владелец.НаименованиеПолное, Ссылка.Владелец.Наименование);
		ОблОсновная.Параметры.Сорт         = Ссылка.ЛабораторныйАнализ.Сорт;
		ОблОсновная.Параметры.НачальникВТЛ = Руководители.НачальникВТЛ;

		Для Каждого Стр Из Ссылка.ЛабораторныйАнализ.Результаты Цикл
			
			Если Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Ядро Тогда
				ОблОсновная.Параметры.ДоброкачЯдро = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Цвет Тогда
				ОблОсновная.Параметры.Цвет = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Запах Тогда
				ОблОсновная.Параметры.Запах = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Вкус Тогда
				ОблОсновная.Параметры.Вкус = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Влажность Тогда
				ОблОсновная.Параметры.Влажность = Стр.Значение;			
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.СорнаяПримесь Тогда
				ОблОсновная.Параметры.СорнаяПримесь = Стр.Значение;			
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.МинеральнаяПримесь Тогда
				ОблОсновная.Параметры.МинеральнаяПримесь = Стр.Значение;			
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.БитоеЗерно Тогда
				ОблОсновная.Параметры.БитоеЗерно = Стр.Значение;			
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Испорченные Тогда
				ОблОсновная.Параметры.Испорченные = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Мучель Тогда
				ОблОсновная.Параметры.Мучель = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Зольность Тогда
				ОблОсновная.Параметры.Зольность = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Зараженность Тогда
				ОблОсновная.Параметры.Зараженность = Стр.Значение;	
			КонецЕсли;
			
		КонецЦикла;		
				
		ТабДокумент.Вывести(ОблОсновная);		
		
	КонецЦикла;
			
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьФорма42(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	
    СтруктураПечати = ХранилищеОбщихНастроек.Загрузить("ИНАГРО_ИНАГРО_СвидетельствоОКачествеЗерна_Форма42");	
	ВидМакета = СтруктураПечати.ВыбраннаяПечатнаяФорма;
	
	УстановитьПривилегированныйРежим(Истина);

	ТабДокумент = Новый ТабличныйДокумент;   		
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНАГРО_СвидетельствоОКачествеЗерна_Форма42";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_Форма42");
    
    // печать производится на языке, указанном в настройках пользователя
    КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
    Макет.КодЯзыкаМакета = КодЯзыкаПечать;
    
    ПервыйДокумент = Истина;	
	
	Для каждого Ссылка Из МассивОбъектов Цикл
		Если СтруктураПечати.ВыбраннаяПечатнаяФорма = "Все" Тогда
			ХХ = 3;
			ВидМакета = "Свидетельство";
		Иначе
			ХХ = 1;
		КонецЕсли;
		
		Пока ХХ > 0 Цикл
			
			ОблОсновная = Макет.ПолучитьОбласть("Основная");
			ОблОсновная.Параметры.Заполнить(Ссылка);
			Если ВидМакета = "Копия" Тогда
				ОблОсновная.Параметры.Вид = "КОПІЯ";	
			ИначеЕсли ВидМакета = "Корешок" Тогда
				ОблОсновная.Параметры.Вид = "КОРІНЕЦЬ";	
			КонецЕсли;
			
			ОблОСновная.Параметры.Организация = ?(ЗначениеЗаполнено(Ссылка.Организация.НаименованиеПолное),Ссылка.Организация.НаименованиеПолное,Ссылка.Организация.Наименование);
			ОблОсновная.Параметры.Число = ДЕНЬ(Ссылка.Дата);
			ОблОсновная.Параметры.Месяц = Формат(Ссылка.Дата,"ДФ = ММ");
			ОблОсновная.Параметры.Год = ПРАВ(ГОД(Ссылка.Дата),2);
			// Данные лаб. анализа
			ОблОсновная.Параметры.Происхождение = Ссылка.ЛабораторныйАнализ.Происхождение;
			ОблОсновная.Параметры.Клас = Ссылка.ЛабораторныйАнализ.Класс;
			ОблОсновная.Параметры.Сорт = Ссылка.ЛабораторныйАнализ.Сорт;
			Для каждого Стр  Из Ссылка.ЛабораторныйАнализ.Результаты Цикл
				Если Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Тип Тогда
					ОблОсновная.Параметры.Тип = Стр.Значение;
				ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.ПодТип Тогда
					ОблОсновная.Параметры.ПодТип = Стр.Значение;
				ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.ПроходСита Тогда
					ОблОсновная.Параметры.ПроходСита = Стр.Значение;
				ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.КлейковинаКоличество Тогда
					ОблОсновная.Параметры.КлейковинаКоличество = Стр.Значение;
				ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.КлейковинаКачество Тогда
					Если (Число(Стр.Значение) >= 45) и (Число(Стр.Значение) <= 75) Тогда
						Група = "I";
					ИначеЕсли (Число(Стр.Значение) >= 80) и (Число(Стр.Значение) <= 100) Тогда
						Група = "II";
					ИначеЕсли (Число(Стр.Значение) >= 105) и (Число(Стр.Значение) <= 120) Тогда
						Група = "III";
					КонецЕсли;
					ОблОсновная.Параметры.КлейковинаГрупа = Група;
					ОблОсновная.Параметры.КлейковинаКачество = Стр.Значение;
				ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Цвет Тогда
					ОблОсновная.Параметры.Цвет = Стр.Значение;
				ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Натура Тогда
					ОблОсновная.Параметры.Натура = Стр.Значение;
				ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.МинеральнаяПримесь Тогда
					ОблОсновная.Параметры.Минер = Стр.Значение;
				ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.БитоеЗерно Тогда
					ОблОсновная.Параметры.Быти = Стр.Значение;
				ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Зараженность Тогда
					ОблОсновная.Параметры.Зараженость = Стр.Значение;
				ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Белок Тогда
					ОблОсновная.Параметры.Белок = Стр.Значение;
				ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.ЧислоПадения Тогда
					ОблОсновная.Параметры.ЧислоПадения = Стр.Значение;
				КонецЕсли;
			КонецЦикла; 
			
			ПримечаниеДоп = Ссылка.Примечание;
			
			ОБлОсновная.Параметры.Примечание1 = ?(НЕ ПримечаниеДоп = "",СформироватьПримечание(ПримечаниеДоп,1,30),"");
			ОБлОсновная.Параметры.Примечание2 = ?(НЕ ПримечаниеДоп = "",СформироватьПримечание(ПримечаниеДоп),"");
			ОБлОсновная.Параметры.Примечание3 = ?(НЕ ПримечаниеДоп = "",СформироватьПримечание(ПримечаниеДоп),"");
			ОБлОсновная.Параметры.Примечание4 = ?(НЕ ПримечаниеДоп = "",СформироватьПримечание(ПримечаниеДоп),"");
			ОБлОсновная.Параметры.Примечание5 = ?(НЕ ПримечаниеДоп = "",СформироватьПримечание(ПримечаниеДоп),"");
			
			ТабДокумент.Вывести(ОблОсновная);
			
			ХХ = ХХ - 1;
			
			Если ХХ = 2 Тогда
				ОблПустая = Макет.ПолучитьОбласть("Пустая");
				ТабДокумент.Вывести(ОблПустая);
				ВидМакета = "Копия";
			ИначеЕсли ХХ = 1 Тогда
				
				ВидМакета = "Корешок"
			КонецЕсли;
			
		КонецЦикла;		
	КонецЦикла;

	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьФорма42_2013(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
		
    СтруктураПечати = ХранилищеОбщихНастроек.Загрузить("ИНАГРО_ИНАГРО_СвидетельствоОКачествеЗерна_Форма42");	
	ВидМакета = СтруктураПечати.ВыбраннаяПечатнаяФорма;
	
	УстановитьПривилегированныйРежим(Истина);

	ТабДокумент = Новый ТабличныйДокумент;   		
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНАГРО_СвидетельствоОКачествеЗерна_Форма42_2013";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_Форма42_2013");
    
    // печать производится на языке, указанном в настройках пользователя
    КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
    Макет.КодЯзыкаМакета = КодЯзыкаПечать;
    
    ПервыйДокумент = Истина;	
	
	Для каждого Ссылка Из МассивОбъектов Цикл
		Если СтруктураПечати.ВыбраннаяПечатнаяФорма = "Все" Тогда
			ХХ = 4;
			ВидМакета = "Свидетельство";
		Иначе
			ХХ = 1;
		КонецЕсли;
		
		Пока ХХ > 0 Цикл
			
			ОблОсновная = Макет.ПолучитьОбласть("Основная");
			ОблОсновная.Параметры.Заполнить(Ссылка);
			Если ВидМакета = "Копия" Тогда
				ОблОсновная.Параметры.Вид = "КОПІЯ";	
			ИначеЕсли ВидМакета = "Корешок" Тогда
				ОблОсновная.Параметры.Вид = "КОРІНЕЦЬ";	
			КонецЕсли;
			
			ОблОСновная.Параметры.Организация = ?(ЗначениеЗаполнено(Ссылка.Организация.НаименованиеПолное),Ссылка.Организация.НаименованиеПолное,Ссылка.Организация.Наименование);
			ОблОсновная.Параметры.Дата = Формат(Ссылка.Дата,"ДФ='дд ММММ гггг'")+" р.";
			ВидКультуры = ИНАГРО_Элеватор.ПолучитьДополнительныйРеквизитНоменклатуры(Ссылка.Номенклатура,"ВидКультуры");
			ОблОсновная.Параметры.ГОСТ = ВидКультуры.ГОСТ;
			ОблОсновная.Параметры.Отправитель = Ссылка.Отправитель;
			
			ТабСорПр = Новый ТаблицаЗначений;
			ТабСорПр.Колонки.Добавить("Характеристика");
			ТабСорПр.Колонки.Добавить("Значение");
			ТабЗернПр = Новый ТаблицаЗначений;
			ТабЗернПр.Колонки.Добавить("Характеристика");
			ТабЗернПр.Колонки.Добавить("Значение");
			
			// Данные лаб. анализа
			ОблОсновная.Параметры.Происхождение = Ссылка.ЛабораторныйАнализ.Происхождение;
			ОблОсновная.Параметры.Клас = Ссылка.ЛабораторныйАнализ.Класс;
			ОблОсновная.Параметры.Сорт = Ссылка.ЛабораторныйАнализ.Сорт;
			Для каждого Стр Из Ссылка.ЛабораторныйАнализ.Результаты Цикл
				Если Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Тип Тогда
					ОблОсновная.Параметры.Тип = Стр.Значение;
				ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.ПодТип Тогда
					ОблОсновная.Параметры.ПодТип = Стр.Значение;
					//ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.ПроходСита1_0 Тогда
					//	ОблОсновная.Параметры.ПроходСита = Стр.Значение;
				ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.КлейковинаКоличество Тогда
					ОблОсновная.Параметры.КлейковинаКоличество = Стр.Значение;
				ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.КлейковинаКачество Тогда
					Если (Число(Стр.Значение) >= 45) и (Число(Стр.Значение) <= 75) Тогда
						Група = "I";
					ИначеЕсли (Число(Стр.Значение) >= 80) и (Число(Стр.Значение) <= 100) Тогда
						Група = "II";
					ИначеЕсли (Число(Стр.Значение) >= 105) и (Число(Стр.Значение) <= 120) Тогда
						Група = "III";
					КонецЕсли;
					ОблОсновная.Параметры.Група = Група;
					ОблОсновная.Параметры.КлейковинаКачество = Стр.Значение;
				ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Цвет Тогда
					ОблОсновная.Параметры.Цвет = Стр.Значение;
				ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Натура Тогда
					ОблОсновная.Параметры.Натура = Стр.Значение;
				ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Запах Тогда
					ОблОсновная.Параметры.Запах = Стр.Значение;
				Иначе
					Если Стр.Характеристика.ТипХарактеристики = Перечисления.ИНАГРО_ТипыХарактеристик.ВидСорнойПримеси Тогда
						СтрНовТаб = ТабСорПр.Добавить();
						СтрНовТаб.Характеристика = Стр.Характеристика;
						СтрНовТаб.Значение = Стр.Значение;
					ИначеЕсли Стр.Характеристика.ТипХарактеристики = Перечисления.ИНАГРО_ТипыХарактеристик.ВидЗерновойПримеси Тогда
						СтрНовТаб = ТабЗернПр.Добавить();
						СтрНовТаб.Характеристика = Стр.Характеристика;
						СтрНовТаб.Значение = Стр.Значение;
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла; 
			ТабСорПр.Сортировать("Значение Убыв");
			ТабЗернПр.Сортировать("Значение Убыв");
			Поряд = 0;
			Для Каждого СтрТаб Из ТабСорПр Цикл
				Если Поряд = 6 Тогда
					Прервать;
				КонецЕсли;	
				Поряд = Поряд + 1;
				ОблОсновная.Параметры["ИмСорной"+Поряд] = СтрТаб.Характеристика;
				ОблОсновная.Параметры["ДрСорПр"+Поряд] = СтрТаб.Значение;
			КонецЦикла;	
			Поряд = 0;
			Для Каждого СтрТаб Из ТабЗернПр Цикл
				Если Поряд = 6 Тогда
					Прервать;
				КонецЕсли;	
				Поряд = Поряд + 1;
				ОблОсновная.Параметры["ИмЗерн"+Поряд] = СтрТаб.Характеристика;
				ОблОсновная.Параметры["ДрЗернПри"+Поряд] = СтрТаб.Значение;
			КонецЦикла;	
			
			ТабДокумент.Вывести(ОблОсновная);
			
			ХХ = ХХ - 1;
			ОблПустая = Макет.ПолучитьОбласть("Пустая");
			ТабДокумент.Вывести(ОблПустая);
			
			Если ХХ = 3 Тогда
				ВидМакета = "Копия";
			ИначеЕсли ХХ = 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ВидМакета = "Корешок"
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
		
		Возврат ТабДокумент;
		
	КонецФункции //
	
Функция ПечатьФорма42_2014(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
		
    СтруктураПечати = ХранилищеОбщихНастроек.Загрузить("ИНАГРО_ИНАГРО_СвидетельствоОКачествеЗерна_Форма42");	
	ВидМакета = СтруктураПечати.ВыбраннаяПечатнаяФорма;
	
	УстановитьПривилегированныйРежим(Истина);

	ТабДокумент = Новый ТабличныйДокумент;   		
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНАГРО_СвидетельствоОКачествеЗерна_Форма42_2014";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_Форма42_2014");
    
    // печать производится на языке, указанном в настройках пользователя
    КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
    Макет.КодЯзыкаМакета = КодЯзыкаПечать;
    
    ПервыйДокумент = Истина;	
	
	Для каждого Ссылка Из МассивОбъектов Цикл
		
		ОблОсновная = Макет.ПолучитьОбласть("Основная");
		ОблОсновная.Параметры.Заполнить(Ссылка);

		ИнфоОрг = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Ссылка.Организация, Ссылка.Дата);
		ОблОСновная.Параметры.ЕДРПОУ = ИнфоОрг.КодПоЕДРПОУ;
		
		ОблОСновная.Параметры.Организация = ?(ЗначениеЗаполнено(Ссылка.Организация.НаименованиеПолное),Ссылка.Организация.НаименованиеПолное,Ссылка.Организация.Наименование);
		ОблОсновная.Параметры.Дата = Формат(Ссылка.Дата,"ДФ='дд ММММ гггг'")+" р.";
		ВидКультуры = ИНАГРО_Элеватор.ПолучитьДополнительныйРеквизитНоменклатуры(Ссылка.Номенклатура,"ВидКультуры");
		ОблОсновная.Параметры.ГОСТ = ВидКультуры.ГОСТ;		
		
		ТабСорПр = Новый ТаблицаЗначений;
		ТабСорПр.Колонки.Добавить("Характеристика");
		ТабСорПр.Колонки.Добавить("Значение");
		ТабЗернПр = Новый ТаблицаЗначений;
		ТабЗернПр.Колонки.Добавить("Характеристика");
		ТабЗернПр.Колонки.Добавить("Значение");
		
		// Данные лаб. анализа
		ОблОсновная.Параметры.Происхождение = Ссылка.ЛабораторныйАнализ.Происхождение;
		ОблОсновная.Параметры.Клас = Ссылка.ЛабораторныйАнализ.Класс;
		ОблОсновная.Параметры.Сорт = Ссылка.ЛабораторныйАнализ.Сорт;
		Для каждого Стр Из Ссылка.ЛабораторныйАнализ.Результаты Цикл
			Если Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Тип Тогда
				ОблОсновная.Параметры.Тип = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.ПодТип Тогда
				ОблОсновная.Параметры.ПодТип = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.КлейковинаКоличество Тогда
				ОблОсновная.Параметры.КлейковинаКоличество = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.КлейковинаКачество Тогда
				Если (Число(Стр.Значение) >= 45) и (Число(Стр.Значение) <= 75) Тогда
					Група = "I";
				ИначеЕсли (Число(Стр.Значение) >= 80) и (Число(Стр.Значение) <= 100) Тогда
					Група = "II";
				ИначеЕсли (Число(Стр.Значение) >= 105) и (Число(Стр.Значение) <= 120) Тогда
					Група = "III";
				КонецЕсли;
					ОблОсновная.Параметры.КлейковинаГрупа = Група;
					ОблОсновная.Параметры.КлейковинаКачество = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.ПроходСита Тогда
				ОблОсновная.Параметры.ПроходСита = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Белок Тогда
				ОблОсновная.Параметры.Белок = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.ЧислоПадения Тогда
				ОблОсновная.Параметры.ЧислоПадения = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Цвет Тогда
				ОблОсновная.Параметры.Цвет = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Натура Тогда
				ОблОсновная.Параметры.Натура = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Запах Тогда
				ОблОсновная.Параметры.Запах = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Стекловидность Тогда
				ОблОсновная.Параметры.Стекловидность = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.КлопЧерепашки Тогда
				ОблОсновная.Параметры.КлопЧерепашки = Стр.Значение;
			Иначе
				Если Стр.Характеристика.ТипХарактеристики = Перечисления.ИНАГРО_ТипыХарактеристик.ВидСорнойПримеси Тогда
					СтрНовТаб = ТабСорПр.Добавить();
					СтрНовТаб.Характеристика = Стр.Характеристика;
					СтрНовТаб.Значение = Стр.Значение;
				ИначеЕсли Стр.Характеристика.ТипХарактеристики = Перечисления.ИНАГРО_ТипыХарактеристик.ВидЗерновойПримеси Тогда
					СтрНовТаб = ТабЗернПр.Добавить();
					СтрНовТаб.Характеристика = Стр.Характеристика;
					СтрНовТаб.Значение = Стр.Значение;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла; 
		ТабСорПр.Сортировать("Значение Убыв");
		ТабЗернПр.Сортировать("Значение Убыв");
		Поряд = 0;
		Для Каждого СтрТаб Из ТабСорПр Цикл
			Если Поряд = 7 Тогда
				Прервать;
			КонецЕсли;	
			Поряд = Поряд + 1;
			ОблОсновная.Параметры["ИмСорной"+Поряд] = СтрТаб.Характеристика;
			ОблОсновная.Параметры["ДрСорПр"+Поряд] = СтрТаб.Значение;
		КонецЦикла;	
		Поряд = 0;
		Для Каждого СтрТаб Из ТабЗернПр Цикл
			Если Поряд = 7 Тогда
				Прервать;
			КонецЕсли;	
			Поряд = Поряд + 1;
			ОблОсновная.Параметры["ИмЗерн"+Поряд] = СтрТаб.Характеристика;
			ОблОсновная.Параметры["ДрЗернПри"+Поряд] = СтрТаб.Значение;
		КонецЦикла;	
		
		ОБлОсновная.Параметры.Примечание1 = Ссылка.Примечание;
		ОБлОсновная.Параметры.Отправитель = Ссылка.Отправитель;
		ОБлОсновная.Параметры.Транспорт   = Ссылка.НомерТранспорта;
		ТабДокумент.Вывести(ОблОсновная);
			
	КонецЦикла;	
	Возврат ТабДокумент;
	
КонецФункции //
	
Функция ПечатьФорма42_2021(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	
	//СтруктураПечати = ХранилищеОбщихНастроек.Загрузить("ИНАГРО_ИНАГРО_СвидетельствоОКачествеЗерна_Форма42");	
	//ВидМакета = СтруктураПечати.ВыбраннаяПечатнаяФорма;
	
	УстановитьПривилегированныйРежим(Истина);

	ТабДокумент = Новый ТабличныйДокумент;   		
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНАГРО_СвидетельствоОКачествеЗерна_Форма42_2021";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИНАГРО_СвидетельствоОКачествеЗерна.ПФ_MXL_UK_Форма42_2021");
    
    // печать производится на языке, указанном в настройках пользователя
    КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
    Макет.КодЯзыкаМакета = КодЯзыкаПечать;
    
    ПервыйДокумент = Истина;	
	
	Для каждого Ссылка Из МассивОбъектов Цикл
		
		СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Ссылка.Организация, Ссылка.Дата);
		Руководители          = ИНАГРО_Элеватор.ОтветственныеЛицаОрганизацииИмяФамилия(Ссылка.Организация, Ссылка.Дата);
		ВидКультуры           = ИНАГРО_Элеватор.ПолучитьДополнительныйРеквизитНоменклатуры(Ссылка.Номенклатура, "ВидКультуры");

		//Если СтруктураПечати.ВыбраннаяПечатнаяФорма = "Все" Тогда
		//	ХХ = 3;
		//	ВидМакета = "Свидетельство";
		//Иначе
		//	ХХ = 1;
		//КонецЕсли;
		//
		//Пока ХХ > 0 Цикл
		
		ОблОсновная = Макет.ПолучитьОбласть("Основная");
		ОблОсновная.Параметры.Заполнить(Ссылка);
		//	Если ВидМакета = "Копия" Тогда
		//		ОблОсновная.Параметры.Вид = "КОПІЯ";	
		//	ИначеЕсли ВидМакета = "Корешок" Тогда
		//		ОблОсновная.Параметры.Вид = "КОРІНЕЦЬ";	
		//	КонецЕсли;
		
		ОблОСновная.Параметры.ЕДРПОУ        = СведенияОбОрганизации.КодПоЕДРПОУ;
		ОблОСновная.Параметры.Организация   = ?(ЗначениеЗаполнено(Ссылка.Организация.НаименованиеПолное),Ссылка.Организация.НаименованиеПолное,Ссылка.Организация.Наименование);
		ОблОсновная.Параметры.НачальникВТЛ  = Руководители.НачальникВТЛ;
        ОблОсновная.Параметры.ДатаДок     = Формат(Ссылка.Дата, "ДФ='дд ММММ гггг';Л="+ Локализация.ОпределитьКодЯзыкаДляФормат("uk"));
		ОблОсновная.Параметры.Происхождение = Ссылка.ЛабораторныйАнализ.Происхождение;
		ОблОсновная.Параметры.Класс         = Ссылка.ЛабораторныйАнализ.Класс;
		ОблОсновная.Параметры.Сорт          = Ссылка.ЛабораторныйАнализ.Сорт;
		ОблОсновная.Параметры.Стандарт      = ВидКультуры.ГОСТ;
		ОблОсновная.Параметры.ДиаметрСита   = ВидКультуры.ДиаметрСита;
		ОБлОсновная.Параметры.Транспорт   	= Ссылка.НомерТранспорта;
		
		
		ИндексЗерновойПримеси = 1;
		ИндексСорнойПримеси   = 1;

		Для Каждого Стр Из Ссылка.ЛабораторныйАнализ.Результаты Цикл
			
			ИмяХарактеристики      = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.ПолучитьИмяПредопределенного(Стр.Характеристика);
			ЗначениеХарактеристики = Стр.Значение;
			ВесХарактеристики      = Стр.Вес;
			ДопИнфХарактеристики   = Стр.ДопИнформация;
			
			Если Стр.Характеристика.ТипХарактеристики = Перечисления.ИНАГРО_ТипыХарактеристик.ВидЗерновойПримеси  Тогда
				
				Если ИндексЗерновойПримеси > 2 Тогда
					Продолжить;
				КонецЕсли;			
				
				ИмяХарактеристики     = "ВидЗерновойПримеси" + ИндексЗерновойПримеси;
				ИндексЗерновойПримеси = ИндексЗерновойПримеси + 1;
				
				Если ВесХарактеристики = 0 Тогда 
					ЗначениеХарактеристики = "" + Стр.Характеристика + "  " + ДопИнфХарактеристики + "  -  " + СокрЛП(Формат(Стр.Значение,"ЧДЦ=2")) + " " + Стр.ЕдиницаИзмерения;
				Иначе
					ЗначениеХарактеристики = "" + Стр.Характеристика + "  " + ДопИнфХарактеристики +"  -  " + "  вес- "+ВесХарактеристики+"гр -"+ Стр.Значение + " "+Стр.ЕдиницаИзмерения;
				КонецЕсли;
				
				ОблОсновная.Параметры[ИмяХарактеристики] = СокрЛП(ЗначениеХарактеристики);
				
			ИначеЕсли Стр.Характеристика.ТипХарактеристики = Перечисления.ИНАГРО_ТипыХарактеристик.ВидСорнойПримеси Тогда
				  //ИЛИ Стр.Характеристика.ТипХарактеристики = Перечисления.ИНАГРО_ТипыХарактеристик.ПроходСита Тогда
				
				Если ИндексСорнойПримеси > 2 Тогда
					Продолжить;
				КонецЕсли;			
				
				ИмяХарактеристики   = "ВидСорнойПримеси" + ИндексСорнойПримеси;
				ИндексСорнойПримеси = ИндексСорнойПримеси + 1;
				
				Если ВесХарактеристики = 0 Тогда 
					ЗначениеХарактеристики = "" + Стр.Характеристика + "  " + ДопИнфХарактеристики + "  -  " + СокрЛП(Формат(Стр.Значение,"ЧДЦ=2")) + " "+Стр.ЕдиницаИзмерения;
				Иначе
					ЗначениеХарактеристики = "" + Стр.Характеристика + "  " + ДопИнфХарактеристики + "  -  " + "  вес- " + ВесХарактеристики + "гр -" + Стр.Значение + " " +Стр.ЕдиницаИзмерения;
				КонецЕсли;
				
				ОблОсновная.Параметры[ИмяХарактеристики] = СокрЛП(ЗначениеХарактеристики);	
				
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Тип Тогда
				ОблОсновная.Параметры.Тип = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.ПодТип Тогда
				ОблОсновная.Параметры.ПодТип = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.ПроходСита Тогда
				ОблОсновная.Параметры.ПроходСита = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.КлейковинаКоличество Тогда
				ОблОсновная.Параметры.КлейковинаКоличество = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.КлейковинаКачество Тогда
				Если (Число(Стр.Значение) >= 45) и (Число(Стр.Значение) <= 75) Тогда
					Группа = "I";
				ИначеЕсли (Число(Стр.Значение) >= 80) и (Число(Стр.Значение) <= 100) Тогда
					Группа = "II";
				ИначеЕсли (Число(Стр.Значение) >= 105) и (Число(Стр.Значение) <= 120) Тогда
					Группа = "III";
				КонецЕсли;
				ОблОсновная.Параметры.КлейковинаГруппа = Группа;
				ОблОсновная.Параметры.КлейковинаКачество = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Цвет Тогда
				ОблОсновная.Параметры.Цвет = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Натура Тогда
				ОблОсновная.Параметры.Натура = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Белок Тогда
				ОблОсновная.Параметры.Белок = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.ЧислоПадения Тогда
				ОблОсновная.Параметры.ЧислоПадения = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Запах Тогда
				ОблОсновная.Параметры.Запах = Стр.Значение;
			ИначеЕсли Стр.Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.Стекловидность Тогда
				ОблОсновная.Параметры.Стекловидность = Стр.Значение;
			КонецЕсли;
			
		КонецЦикла; 
		
		ТабДокумент.Вывести(ОблОсновная);
			
		//	ХХ = ХХ - 1;
		//	
		//	Если ХХ = 2 Тогда
		//		ОблПустая = Макет.ПолучитьОбласть("Пустая");
		//		ТабДокумент.Вывести(ОблПустая);
		//		ВидМакета = "Копия";
		//	ИначеЕсли ХХ = 1 Тогда
		//		
		//		ВидМакета = "Корешок"
		//	КонецЕсли;
		//	
		//КонецЦикла;
		
	КонецЦикла;

	Возврат ТабДокумент;
	
КонецФункции

Функция СформироватьПримечание(ПолнаяСтрока, Х1 = 1, Х2 = 53)
	
	ОтформатированнаяСтрока = "";
	Количество = СтрДлина(ПолнаяСтрока);	
	
	Если Количество < Х2 Тогда
		ОтформатированнаяСтрока = ПолнаяСтрока;
		ПолнаяСтрока = СтрЗаменить(ПолнаяСтрока,ЛЕВ(ПолнаяСтрока,Х2),"");
		ВОЗВРАТ ОтформатированнаяСтрока;		
	КонецЕсли;
	
	НайденныйПробел = Ложь;
	
	Пока НайденныйПробел = Ложь Цикл
		СтрокаДоп = Сред(ПолнаяСтрока,Х1,Х2);
		Если Найти(Сред(СтрокаДоп,Х2,Х2)," ") > 0 Тогда
			ОтформатированнаяСтрока	= ЛЕВ(ПолнаяСтрока,Х2);
			ПолнаяСтрока = Сред(ПолнаяСтрока,Х2);
			НайденныйПробел = Истина;
		Иначе
			Если Х2 = 0 Тогда
				НайденныйПробел = Истина;				
			Иначе
				НайденныйПробел = Ложь;	
				Х2 = Х2 - 1;
			КонецЕсли;   			
		КонецЕсли;
		
	КонецЦикла;
	
	ВОЗВРАТ ОтформатированнаяСтрока;
	
КонецФункции

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура;	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьВыбраннуюПечатнуюФорму(ВыбранныйЭлемент) Экспорт 
	
	СтруктураСохранения = Новый Структура("ВыбраннаяПечатнаяФорма", ВыбранныйЭлемент);		
	ХранилищеОбщихНастроек.Сохранить("ИНАГРО_ИНАГРО_СвидетельствоОКачествеЗерна_Форма42", , СтруктураСохранения);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
